artillery/scripts/test.yml
config:
  target: 'http://localhost:3001'
  environments:
    functional:
      phases:
        - duration: 1
          arrivalCount: 1
      plugins:
        expect: {}

    load:
      phases:
        - duration: 60
          arrivalRate: 5
          name: Warm up
        - duration: 120
          arrivalRate: 5
          rampTo: 100
          name: Ramp up load
        - duration: 600
          arrivalRate: 100
          name: Sustained load

    stress:
      phases:
        - duration: 60
          arrivalRate: 5
          name: Warm up

        - duration: 60
          arrivalRate: 5
          rampTo: 100
          name: Initial ramp to 100
        - duration: 60
          arrivalRate: 100
          name: Sustain 100

        - duration: 60
          arrivalRate: 100
          rampTo: 200
          name: Ramp to 200
        - duration: 60
          arrivalRate: 200
          name: Sustain 200

        - duration: 60
          arrivalRate: 200
          rampTo: 300
          name: Ramp to 300
        - duration: 60
          arrivalRate: 300
          name: Sustain 300

        - duration: 60
          arrivalRate: 300
          rampTo: 400
          name: Ramp to 400
        - duration: 60
          arrivalRate: 400
          name: Sustain 400

        - duration: 120
          arrivalRate: 400
          rampTo: 0
          name: Recovery

    spike:
      phases:
        - duration: 10
          arrivalRate: 5
          rampTo: 100
          name: Initiate
        - duration: 60
          arrivalRate: 100
          name: Warm up
        - duration: 10
          arrivalRate: 100
          rampTo: 1400
          name: Spike to 1400
        - duration: 180
          arrivalRate: 1400
          name: Sustain spike
        - duration: 10
          arrivalRate: 1400
          rampTo: 100
          name: Drop to 100
        - duration: 60
          arrivalRate: 100
          name: Sustain norm
        - duration: 10
          arrivalRate: 100
          rampTo: 0
          name: Finish

    soak:
      phases:
        - duration: 120
          arrivalRate: 1
          rampTo: 300
          name: Warm up
        - duration: 1800
          arrivalRate: 300
          name: Soak
        - duration: 60
          arrivalRate: 300
          rampTo: 0
          name: Drop

scenarios:
  - name: 'Browsing products'
    flow:
      - get:
          url: '/products/{{ $randomNumber(1,1000011) }}'
          capture:
            - json: '$.id'
              as: 'productId'
          expect:
            - statusCode: 200
            - contentType: json
      - loop:
          - get:
              url: '/products/{{ productId }}/styles'
              expect:
                - statusCode: 200
                - contentType: json
          - get:
              url: '/products/{{ productId }}/related'
              capture:
                - json: '$[0]'
                  as: 'productId'
              expect:
                - statusCode: 200
                - contentType: json
          - think: '{{ $randomNumber(1, 3) }}'
        count: '{{ $randomNumber(1, 5) }}'